#!/usr/bin/env python
# coding: utf-8

# In[1]:


a = 1
b = "python"
c = [1,2,3]


# In[9]:


a = [1,2,3]


# In[8]:


id(a)


# In[21]:


a = [1,2,3]
b = a


# In[22]:


a


# In[23]:


b


# In[24]:


id(a)


# In[25]:


id(b)


# In[26]:


a is b # a와 b가 가리키는 객체는 동일하니? [주석]


# In[27]:


a[1] = 4  # 1을 4로 바꾸었는데  2가 4로바뀐이유 파이썬은 첫번쨰가 0이다
a


# In[28]:


b


# In[29]:


# [:]이용 콜론 이용  copy 모듈


# In[30]:


a = [1,2,3]


# In[35]:


b = a[:] #슬라이싱


# In[36]:


a[1] = 4


# In[37]:


a


# In[38]:


b


# In[39]:


id(a)


# In[40]:


id(b)


# In[42]:


from copy import copy # 모듈 불러오기 자주 사용하게 될것 ex)라이브러리에서 남이만든것 복사


# In[43]:


b = copy(a)


# In[45]:


b is a


# In[47]:


id(a)


# In[48]:


id(b)


# In[49]:


a = 'python'


# In[50]:


b = 'life'


# In[51]:


a, b = ('python','life')


# In[52]:


a


# In[53]:


b


# In[54]:


[a,b] = ['python','life']


# In[55]:


a = b = 'python'


# In[56]:


a


# In[57]:


b


# In[63]:


a = 3
b = 5
a,b = b,a # 다른언어 보다 직관적인점 다른 임의변수에 객체를 옮기지않고 바꿀수있다


# In[59]:


a


# In[60]:


b


# In[61]:


a,b


# In[62]:


a, b


# In[65]:


# 숫자형 


# In[75]:


a = 123 #int


# In[67]:


a


# In[68]:


a = -128


# In[69]:


a


# In[70]:


a = 0


# In[71]:


a = 1.2


# In[72]:


a = -3.45


# In[73]:


a


# In[76]:


# 8진수 0o 16진수 0x


# In[77]:


a = 3


# In[78]:


b = 4


# In[79]:


a + b


# In[80]:


a ** b


# In[81]:


a  % b


# In[83]:


a % b #??


# In[85]:


23  % 2 # 나머지연산자는 홀수 ,짝수 , 배수 를 알아낼떄 많이 사용


# In[86]:


4 % 2


# In[87]:


a / b


# In[88]:


a = (123124512523516123423)


# In[90]:


a % 2 # 나머지 1 홀수 나머지 0이면 짝수


# In[92]:


15 % 5 # 어떤수로 나누어 0나오면 어떤수의 배수


# In[ ]:




